# NVolume Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MassLevelData..::..NVolume Property
MassLevelData Class See Also
---
The volume of from the level of this MassLevelData (Mass Floor) to the next in the mass.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double NVolume { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NVolume As Double
	Get
```

Visual C++
---
```text
public:
property double NVolume {
	double get ();
}
```

# See Also
MassLevelData Class
Autodesk.Revit.DB.Analysis Namespace